
function __辅助代码(list, 组件) {
    组件.窗口 = list[0]
    组件.选择夹1 = list[0].子组件[0]
    组件.内容区域1 = list[0].子组件[0].子组件[0]
    组件.常用布局1 = list[0].子组件[0].子组件[0].子组件[0]
    组件.内容区域header1 = list[0].子组件[0].子组件[0].子组件[0].子组件[0]
    组件.标签1 = list[0].子组件[0].子组件[0].子组件[0].子组件[0].子组件[0]
    组件.内容区域main1 = list[0].子组件[0].子组件[0].子组件[0].子组件[1]
    组件.按钮_获取时间 = list[0].子组件[0].子组件[0].子组件[0].子组件[1].子组件[0]
    组件.编辑框_时间 = list[0].子组件[0].子组件[0].子组件[0].子组件[1].子组件[1]
    组件.弹性布局2 = list[0].子组件[0].子组件[0].子组件[0].子组件[1].子组件[2]
    组件.内容区域1 = list[0].子组件[0].子组件[0].子组件[0].子组件[1].子组件[2].子组件[0]
    组件.标签2 = list[0].子组件[0].子组件[0].子组件[0].子组件[1].子组件[2].子组件[0].子组件[0]
    组件.内容区域2 = list[0].子组件[0].子组件[0].子组件[0].子组件[1].子组件[2].子组件[1]
    组件.编辑框1 = list[0].子组件[0].子组件[0].子组件[0].子组件[1].子组件[2].子组件[1].子组件[0]
    组件.内容区域3 = list[0].子组件[0].子组件[0].子组件[0].子组件[1].子组件[2].子组件[2]
    组件.按钮2 = list[0].子组件[0].子组件[0].子组件[0].子组件[1].子组件[2].子组件[2].子组件[0]
    组件.内容区域footer1 = list[0].子组件[0].子组件[0].子组件[0].子组件[2]
    组件.标签3 = list[0].子组件[0].子组件[0].子组件[0].子组件[2].子组件[0]
    组件.内容区域aside1 = list[0].子组件[0].子组件[0].子组件[0].子组件[3]
    组件.菜单1 = list[0].子组件[0].子组件[0].子组件[0].子组件[3].子组件[0]
    组件.内容区域2 = list[0].子组件[0].子组件[1]
    组件.表格1 = list[0].子组件[0].子组件[1].子组件[0]
    组件.内容区域1 = list[0].子组件[0].子组件[2]
    组件.登录框1 = list[0].子组件[0].子组件[2].子组件[0]

    return 组件
}
export default __辅助代码
    