
function __辅助代码(list, 组件) {
    组件.窗口 = list[0]
    组件.单选框1 = list[0].子组件[0]
    组件.开关2 = list[0].子组件[1]
    组件.开关1 = list[0].子组件[2]
    组件.按钮2 = list[0].子组件[3]
    组件.多选框2 = list[0].子组件[4]
    组件.选择夹1 = list[0].子组件[5]
    组件.按钮4 = list[0].子组件[5].子组件[0].子组件[0].子组件[0]
    组件.按钮3 = list[0].子组件[5].子组件[0].子组件[0].子组件[1]
    组件.标签1 = list[0].子组件[5].子组件[0].子组件[0].子组件[2]
    组件.标签2 = list[0].子组件[5].子组件[0].子组件[0].子组件[3]
    组件.按钮1 = list[0].子组件[6]
    组件.编辑框1 = list[0].子组件[7]

    return 组件
}
export default __辅助代码
    